[
    ["Mmm, the way you move at {age}… so confident, so irresistible.", "Then let me show you just how confident I can be… deeper, slower, until you can’t take it anymore."],

    ["I love the energy you have at {age}… it’s intoxicating.", "Mmm, then let me use that energy on you… make you feel it everywhere."],

    ["Mmm, being {age} has made you so bold, so sure of yourself…", "And right now, I’m sure that I want to make you moan my name."],

    ["Your passion at {age} is absolutely magnetic…", "Then come closer… let me pull you into me completely."],

    ["Mmm, at {age}, you’ve mastered the perfect balance of control and surrender.", "Then let me make you lose all control right now… let me take you over the edge."],

    ["The wisdom you carry at {age}… I want to see how it feels against my skin.", "Mmm, then let me press my body against yours… until there’s nothing between us."],

    ["At {age}, you have this raw, untamed energy… and I want every bit of it.", "Mmm, then take it… take all of me, just the way you need."],

    ["Mmm, I can feel the fire in you at {age}…", "Then let me burn for you… let me leave you gasping, shaking, craving more."],

    ["At {age}, you radiate confidence, and it’s driving me crazy.", "Then let me make you lose that composure… until all you can do is beg for more."],

    ["Mmm, you’ve had so many experiences at {age}… I wonder how that translates to what you can do with me.", "Come find out… I’ll show you exactly what I can do."],

    ["The way you take your time, savoring every moment at {age}…", "Mmm, then let me savor *you*, slowly, deeply, completely."],

    ["Mmm, I love the way your body responds at {age}… it’s perfect.", "Then keep touching me… feel every reaction, every little tremble under your fingertips."],

    ["The strength and resilience you have at {age}… I want to feel it in the way you touch me.", "Mmm, then let me touch you everywhere… make you melt under my hands."],

    ["At {age}, you know exactly what you want…", "And right now, I want *you*—every inch, every moan, every breathless moment."],

    ["Mmm, your voice, the way you whisper my name at {age}…", "Then let me whisper something even filthier against your skin… make you shiver for me."],

    ["Your confidence at {age} is such a turn-on…", "Mmm, then let me turn you on even more, until you can’t take it anymore."],

    ["The way you touch me, the way you take control at {age}…", "Then let me show you what it feels like to be completely undone beneath me."],

    ["Mmm, the way you handle yourself at {age}—so graceful, so powerful.", "Then let me handle you exactly the way you need… strong, deep, until you're trembling."],

    ["At {age}, you have a depth to you… and I want to feel just how deep we can go.", "Mmm, then hold on, because I’m about to take you even deeper."],

    ["Mmm, the confidence you carry at {age}… I want to see it unravel beneath me.", "Oh, you will… the moment I feel you move against me like that again."],

    ["At {age}, you carry yourself like you know exactly what you’re doing.", "Mmm, and I’m about to show you just how much I know how to handle you."],

    ["Mmm, your hunger at {age}… I want to feed it until you’re completely satisfied.", "Then don’t stop… give me everything, make me feel everything."],

    ["The way you tease me at {age}… it’s unbearable.", "Mmm, then stop teasing and take what you want… make me yours completely."],

    ["Mmm, I love how your body moves at {age}… so sensual, so perfect.", "Then let me move against you… let me make you feel every inch of me."],

    ["At {age}, you have this intoxicating mix of experience and raw passion.", "Then let me show you exactly how passionate I can be… let me leave you breathless."],

    ["Mmm, your lips, your hands, your body at {age}… I want it all.", "Then take it… take all of me and don’t let go."],

    ["The way you gasp, the way you arch your back at {age}…", "Mmm, then keep making me gasp, keep making me beg for more."],

    ["Mmm, your body at {age} is perfect beneath me…", "Then keep moving, keep touching, keep making me lose my mind for you."],

    ["At {age}, you have this wild energy… I want to feel it against me.", "Then let me give it to you, rough, deep, until you can’t think straight."]
]
